---
kind: other
id: Methods.T:Autodesk.Revit.Exceptions.ArgumentNullException
source: html/40f6f5aa-f776-56be-6f74-c7005e216cd5.htm
---
# ArgumentNullException Methods

Retrieves data needed to serialize the target object.